JMS/ws-soap-server/sample/request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
	<Body>
		<getCountryRequest
			xmlns="http://www.digitalis.org/ws/generated">
			<name>Spain</name>
		</getCountryRequest>
	</Body>
</Envelope>